Tekla Open API Reference for Tekla Structures 2025
NewLineElement Class
 The NewLineElement class defines a line feed between the desired elements to create multi-row marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.NewLineElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class NewLineElement : ElementBase
<SerializableAttribute>
Public NotInheritable Class NewLineElement
	Inherits ElementBase
The NewLineElement type exposes the following members.
Constructors
Name | Description
NewLineElement
Initializes a new instance of the NewLineElement class
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace